app/views/users/new.html.erb

          <div class="form-group">
            <%= f.collection_select :city_id, City.all, :id, :name, {prompt: "Ville"}, {class: "form-control"} %>
---
SELECT "cities".* FROM "cities"