app/views/users/show.html.erb

    <div class="container py-4 text-center">
    <% user = User.find(params['id']) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]