app/views/gossips/index.html.erb

      <div class="card-deck">
        <% Gossip.all.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips"

                <a href="<%= gossip_path(gossip.id) %>">
                  <p class="small float-left text-muted"><%= gossip.comments.count %></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]

                </a>
                <p class="small float-right text-muted">Posté par <%= link_to "#{gossip.user.first_name}", user_path(gossip.user.id) %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]