app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @gossip = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
  def set_gossip
    @gossip = Gossip.find(params[:id])