app/controllers/sessions_controller.rb

  def create
    user_params = params.require(:user)
    user = User.find_by(email: user_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nicolas@hodee.com"], ["LIMIT", 1]]