app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "age", "created_at", "updated_at", "city_id", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    user_params = params.require(:user).permit(:first_name, :last_name, :age, :city_id, :email, :password, :password_confirmation)
    @user = User.new(user_params)
    if @user.save